# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
lst = [2, 3, 4, 7, 3, 5, 6]
result = []
if len(lst) % 2 > 0:
    count = len(lst)//2 + 1
else: count = len(lst)//2
for i in range(0, count):
    result.append(lst[i]*lst[-i-1])
print(result)
